HelpDesk/src/DocumentJournals/ЭлектроннаяПочта/ЭлектроннаяПочта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ЭлектроннаяПочта</name>
  <registeredDocuments>Document.ВходящееПисьмо</registeredDocuments>
  <registeredDocuments>Document.ИсходящееПисьмо</registeredDocuments>
  <columns>
    <name>Адресаты</name>
  </columns>
  <columns>
    <name>Важность</name>
  </columns>
  <columns>
    <name>ДатаОтправкиПолучения</name>
  </columns>
  <columns>
    <name>ЕстьВложения</name>
  </columns>
  <columns>
    <name>Отправитель</name>
  </columns>
  <columns>
    <name>ОтправительАдрес</name>
  </columns>
  <columns>
    <name>ОтправительКонтакт</name>
  </columns>
  <columns>
    <name>Отправлено</name>
  </columns>
  <columns>
    <name>Папка</name>
  </columns>
  <columns>
    <name>Получатели</name>
  </columns>
  <columns>
    <name>Получено</name>
  </columns>
  <columns>
    <name>Предмет</name>
  </columns>
  <columns>
    <name>Размер</name>
  </columns>
  <columns>
    <name>Тема</name>
  </columns>
  <columns>
    <name>УчетнаяЗапись</name>
  </columns>
</mdclass:DocumentJournal>

HelpDesk/src/DocumentJournals/ЭлектроннаяПочта/Forms/ПараметрыПисьма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквзитыФормыИзПараметров(Параметры);
	УправлениеДоступностью();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ

&НаСервере
Процедура ЗаполнитьРеквизитФормыИзПараметра(Параметры, ИмяПараметра, ИмяРеквизита = "")
	
	Если Параметры.Свойство(ИмяПараметра) Тогда
		ЭтотОбъект[?(ПустаяСтрока(ИмяРеквизита), ИмяПараметра, ИмяРеквизита)] = Параметры[ИмяПараметра];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквзитыФормыИзПараметров(Параметры)
	
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "ВнутреннийНомер");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "ЗаголовкиИнтернета");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "Дата");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "Получено", "ПолученоОтправлено");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "Отправлено", "ПолученоОтправлено");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "Письмо");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "Кодировка");
	ЗаполнитьРеквизитФормыИзПараметра(Параметры, "УчетнаяЗапись");
	
	ТекущаяУчетнаяЗапись = УчетнаяЗапись;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностью()

	Если ВстроеннаяПочтаКлиентСервер.ЭтоИсходящееПисьмо(Письмо) Тогда
		Элементы.Заголовки.Заголовок = НСтр("ru='Идентификаторы'");
		Элементы.ПолученоОтправлено.Заголовок = НСтр("ru='Отправлено'");
	ИначеЕсли ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(Письмо) Тогда
		Элементы.Заголовки.Заголовок = НСтр("ru='Заголовки интернета'");
		Элементы.ПолученоОтправлено.Заголовок = НСтр("ru='Получено'");
	КонецЕсли;
	
КонецПроцедуры
